In [63]:
#Importing Libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

print(pd.__version__)

# Load Data
dataset = load_dataset('lukebarousse/data_jobs')

# Convert dataset to pandas DataFrame
df = dataset['train'].to_pandas()

# Change string to datetime ('job_posted_date' column)
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

2.2.3

In [6]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [ ]:
#create a function to calulate projected salary in a year
def projected_salary(salary):
    projected_salary = salary * 1.03
    return projected_salary

df_salary = df[pd.notna(df['salary_year_avg'])].copy()
df_salary['predicted_salary_2024'] = df_salary['salary_year_avg'].apply(projected_salary)

In [23]:
df_salary[['salary_year_avg', 'predicted_salary_2024']].head()

     salary_year_avg  predicted_salary_2024
28          109500.0              112785.00
77          140000.0              144200.00
92          120000.0              123600.00
100         228222.0              235068.66
109          89000.0               91670.00

In [ ]:
#one line 
df_salary['predicted_salary_2024'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

In [28]:
df_salary[['salary_year_avg', 'predicted_salary_2024']].head()

     salary_year_avg  predicted_salary_2024
28          109500.0              112785.00
77          140000.0              144200.00
92          120000.0              123600.00
100         228222.0              235068.66
109          89000.0               91670.00

In [ ]:
#or 
df_salary['predicted_salary_2024'] = df_salary['salary_year_avg'] * 1.03

In [30]:
df_salary[['salary_year_avg', 'predicted_salary_2024']].head()

     salary_year_avg  predicted_salary_2024
28          109500.0              112785.00
77          140000.0              144200.00
92          120000.0              123600.00
100         228222.0              235068.66
109          89000.0               91670.00

In [ ]:
df['job_skills'][1]
#list but python thinks its a string

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [39]:
type(df['job_skills'][1])

str

In [64]:
import ast 
ast.literal_eval(df['job_skills'][1])

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [43]:
type(ast.literal_eval(df['job_skills'][1]))

list

In [49]:
def clean_list(string_list):
    if type(string_list) == str:
        return ast.literal_eval(string_list)
    else:
        return string_list

In [50]:
df['job_skills'] = df['job_skills'].apply(clean_list)

In [54]:
type(df['job_skills'][2])

list

In [55]:
type(df['job_skills'][0])

NoneType

In [ ]:
df['job_skills'] = df['job_skills'].apply(lambda string_list: ast.literal_eval(string_list) if pd.notna(string_list) else string_list)

In [66]:
df['job_skills'][0]

In [67]:
df['job_skills'][2]

['python',
 'sql',
 'c#',
 'azure',
 'airflow',
 'dax',
 'docker',
 'kubernetes',
 'jenkins']

Calculate Inflated Salary based on position (Junior vs Senior)

In [72]:
def projected_salary(row):
   if 'Senior' in row['job_title_short']:
      return row['salary_year_avg'] * 1.05
   else:
      return row['salary_year_avg'] * 1.03

In [74]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()

In [76]:
df_salary['projected_salary_2024'] = df_salary.apply(projected_salary, axis=1)

In [78]:
df_salary[['salary_year_avg', 'projected_salary_2024', 'job_title_short']].sample(20)

        salary_year_avg  projected_salary_2024        job_title_short
491834         165000.0             173250.000   Senior Data Engineer
768425         142500.0             146775.000         Data Scientist
419700          96773.0              99676.190          Data Engineer
176561         100000.0             103000.000          Data Engineer
473492         194000.0             199820.000          Data Engineer
732814         147500.0             151925.000          Data Engineer
536147         112500.0             115875.000          Data Engineer
546987         150000.0             154500.000         Data Scientist
655547         125000.0             131250.000  Senior Data Scientist
228777         195500.0             201365.000         Data Scientist
475549         224500.0             231235.000         Data Scientist
323673          99150.0             102124.500         Data Scientist
230411         156000.0             160680.000         Data Scientist
731606         115000.0             120750.000  Senior Data Scientist
536369         204000.0             210120.000         Data Scientist
288147         199000.0             204970.000         Data Scientist
492114         160136.5             164940.595         Data Scientist
394463          90000.0              92700.000           Data Analyst
415126          45000.0              46350.000           Data Analyst
395741         147500.0             151925.000           Data Analyst